ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f6634.h
#define DMA1TSEL_0          (0x0000)  /* DMA channel 1 transfer select 0:  DMA_REQ (sw) */
#define DMA1TSEL_1          (0x0100)  /* DMA channel 1 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA1TSEL_2          (0x0200)  /* DMA channel 1 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA1TSEL_3          (0x0300)  /* DMA channel 1 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA1TSEL_4          (0x0400)  /* DMA channel 1 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA1TSEL_5          (0x0500)  /* DMA channel 1 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA1TSEL_6          (0x0600)  /* DMA channel 1 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA1TSEL_7          (0x0700)  /* DMA channel 1 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA1TSEL_8          (0x0800)  /* DMA channel 1 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA1TSEL_9          (0x0900)  /* DMA channel 1 transfer select 9:  Reserved */
#define DMA1TSEL_10         (0x0A00) /* DMA channel 1 transfer select 10: Reserved */
#define DMA1TSEL_11         (0x0B00) /* DMA channel 1 transfer select 11: Reserved */
#define DMA1TSEL_12         (0x0C00) /* DMA channel 1 transfer select 12: Reserved */
#define DMA1TSEL_13         (0x0D00) /* DMA channel 1 transfer select 13: Reserved */
#define DMA1TSEL_14         (0x0E00) /* DMA channel 1 transfer select 14: Reserved */
#define DMA1TSEL_15         (0x0F00) /* DMA channel 1 transfer select 15: Reserved */
#define DMA1TSEL_16         (0x1000) /* DMA channel 1 transfer select 16: USCIA0 receive */
#define DMA1TSEL_17         (0x1100) /* DMA channel 1 transfer select 17: USCIA0 transmit */
#define DMA1TSEL_18         (0x1200) /* DMA channel 1 transfer select 18: USCIB0 receive */
#define DMA1TSEL_19         (0x1300) /* DMA channel 1 transfer select 19: USCIB0 transmit */
#define DMA1TSEL_20         (0x1400) /* DMA channel 1 transfer select 20: USCIA1 receive */
#define DMA1TSEL_21         (0x1500) /* DMA channel 1 transfer select 21: USCIA1 transmit */
#define DMA1TSEL_22         (0x1600) /* DMA channel 1 transfer select 22: USCIB1 receive */
#define DMA1TSEL_23         (0x1700) /* DMA channel 1 transfer select 23: USCIB1 transmit */
#define DMA1TSEL_24         (0x1800) /* DMA channel 1 transfer select 24: ADC12IFGx */
#define DMA1TSEL_25         (0x1900) /* DMA channel 1 transfer select 25: DAC12_0IFG */
#define DMA1TSEL_26         (0x1A00) /* DMA channel 1 transfer select 26: DAC12_1IFG */
#define DMA1TSEL_27         (0x1B00) /* DMA channel 1 transfer select 27: USB FNRXD */
#define DMA1TSEL_28         (0x1C00) /* DMA channel 1 transfer select 28: USB ready */
#define DMA1TSEL_29         (0x1D00) /* DMA channel 1 transfer select 29: Multiplier ready */
#define DMA1TSEL_30         (0x1E00) /* DMA channel 1 transfer select 30: previous DMA channel DMA0IFG */
#define DMA1TSEL_31         (0x1F00) /* DMA channel 1 transfer select 31: ext. Trigger (DMAE0) */

#define DMA2TSEL_0          (0x0000)  /* DMA channel 2 transfer select 0:  DMA_REQ (sw) */
#define DMA2TSEL_1          (0x0001)  /* DMA channel 2 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA2TSEL_2          (0x0002)  /* DMA channel 2 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA2TSEL_3          (0x0003)  /* DMA channel 2 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA2TSEL_4          (0x0004)  /* DMA channel 2 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA2TSEL_5          (0x0005)  /* DMA channel 2 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA2TSEL_6          (0x0006)  /* DMA channel 2 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA2TSEL_7          (0x0007)  /* DMA channel 2 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA2TSEL_8          (0x0008)  /* DMA channel 2 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA2TSEL_9          (0x0009)  /* DMA channel 2 transfer select 9:  Reserved */
#define DMA2TSEL_10         (0x000A) /* DMA channel 2 transfer select 10: Reserved */
#define DMA2TSEL_11         (0x000B) /* DMA channel 2 transfer select 11: Reserved */
#define DMA2TSEL_12         (0x000C) /* DMA channel 2 transfer select 12: Reserved */
#define DMA2TSEL_13         (0x000D) /* DMA channel 2 transfer select 13: Reserved */
#define DMA2TSEL_14         (0x000E) /* DMA channel 2 transfer select 14: Reserved */
#define DMA2TSEL_15         (0x000F) /* DMA channel 2 transfer select 15: Reserved */
#define DMA2TSEL_16         (0x0010) /* DMA channel 2 transfer select 16: USCIA0 receive */
#define DMA2TSEL_17         (0x0011) /* DMA channel 2 transfer select 17: USCIA0 transmit */
#define DMA2TSEL_18         (0x0012) /* DMA channel 2 transfer select 18: USCIB0 receive */
#define DMA2TSEL_19         (0x0013) /* DMA channel 2 transfer select 19: USCIB0 transmit */
#define DMA2TSEL_20         (0x0014) /* DMA channel 2 transfer select 20: USCIA1 receive */
#define DMA2TSEL_21         (0x0015) /* DMA channel 2 transfer select 21: USCIA1 transmit */
#define DMA2TSEL_22         (0x0016) /* DMA channel 2 transfer select 22: USCIB1 receive */
#define DMA2TSEL_23         (0x0017) /* DMA channel 2 transfer select 23: USCIB1 transmit */
#define DMA2TSEL_24         (0x0018) /* DMA channel 2 transfer select 24: ADC12IFGx */
#define DMA2TSEL_25         (0x0019) /* DMA channel 2 transfer select 25: DAC12_0IFG */
#define DMA2TSEL_26         (0x001A) /* DMA channel 2 transfer select 26: DAC12_1IFG */
#define DMA2TSEL_27         (0x001B) /* DMA channel 2 transfer select 27: USB FNRXD */
#define DMA2TSEL_28         (0x001C) /* DMA channel 2 transfer select 28: USB ready */
#define DMA2TSEL_29         (0x001D) /* DMA channel 2 transfer select 29: Multiplier ready */
#define DMA2TSEL_30         (0x001E) /* DMA channel 2 transfer select 30: previous DMA channel DMA1IFG */
#define DMA2TSEL_31         (0x001F) /* DMA channel 2 transfer select 31: ext. Trigger (DMAE0) */

#define DMA3TSEL_0          (0x0000)  /* DMA channel 3 transfer select 0:  DMA_REQ (sw) */
#define DMA3TSEL_1          (0x0100)  /* DMA channel 3 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA3TSEL_2          (0x0200)  /* DMA channel 3 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA3TSEL_3          (0x0300)  /* DMA channel 3 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA3TSEL_4          (0x0400)  /* DMA channel 3 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA3TSEL_5          (0x0500)  /* DMA channel 3 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA3TSEL_6          (0x0600)  /* DMA channel 3 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA3TSEL_7          (0x0700)  /* DMA channel 3 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA3TSEL_8          (0x0800)  /* DMA channel 3 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA3TSEL_9          (0x0900)  /* DMA channel 3 transfer select 9:  Reserved */
#define DMA3TSEL_10         (0x0A00) /* DMA channel 3 transfer select 10: Reserved */
#define DMA3TSEL_11         (0x0B00) /* DMA channel 3 transfer select 11: Reserved */
#define DMA3TSEL_12         (0x0C00) /* DMA channel 3 transfer select 12: Reserved */
#define DMA3TSEL_13         (0x0D00) /* DMA channel 3 transfer select 13: Reserved */
#define DMA3TSEL_14         (0x0E00) /* DMA channel 3 transfer select 14: Reserved */
#define DMA3TSEL_15         (0x0F00) /* DMA channel 3 transfer select 15: Reserved */
#define DMA3TSEL_16         (0x1000) /* DMA channel 3 transfer select 16: USCIA0 receive */
#define DMA3TSEL_17         (0x1100) /* DMA channel 3 transfer select 17: USCIA0 transmit */
#define DMA3TSEL_18         (0x1200) /* DMA channel 3 transfer select 18: USCIB0 receive */
#define DMA3TSEL_19         (0x1300) /* DMA channel 3 transfer select 19: USCIB0 transmit */
#define DMA3TSEL_20         (0x1400) /* DMA channel 3 transfer select 20: USCIA1 receive */
#define DMA3TSEL_21         (0x1500) /* DMA channel 3 transfer select 21: USCIA1 transmit */
#define DMA3TSEL_22         (0x1600) /* DMA channel 3 transfer select 22: USCIB1 receive */
#define DMA3TSEL_23         (0x1700) /* DMA channel 3 transfer select 23: USCIB1 transmit */
#define DMA3TSEL_24         (0x1800) /* DMA channel 3 transfer select 24: ADC12IFGx */
#define DMA3TSEL_25         (0x1900) /* DMA channel 3 transfer select 25: DAC12_0IFG */
#define DMA3TSEL_26         (0x1A00) /* DMA channel 3 transfer select 26: DAC12_1IFG */
#define DMA3TSEL_27         (0x1B00) /* DMA channel 3 transfer select 27: USB FNRXD */
#define DMA3TSEL_28         (0x1C00) /* DMA channel 3 transfer select 28: USB ready */
#define DMA3TSEL_29         (0x1D00) /* DMA channel 3 transfer select 29: Multiplier ready */
#define DMA3TSEL_30         (0x1E00) /* DMA channel 3 transfer select 30: previous DMA channel DMA2IFG */
#define DMA3TSEL_31         (0x1F00) /* DMA channel 3 transfer select 31: ext. Trigger (DMAE0) */

